In [1]:
import numpy as np
import pandas as pd

In [3]:
sr=pd.Series([1,2,3,4,5])
sr

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [20]:
sr1=pd.Series(np.arange(10,51,10),index=['a','b','c','d','e'])
sr1

a    10
b    20
c    30
d    40
e    50
dtype: int32

In [24]:
sr1['a']

10

In [25]:
#DataFrame

In [26]:
list=[(101,'john',23),(102,'anoop',25),(132,"nila",32)]
list

[(101, 'john', 23), (102, 'anoop', 25), (132, 'nila', 32)]

In [28]:
dd=pd.DataFrame(list)
dd

     0      1   2
0  101   john  23
1  102  anoop  25
2  132   nila  32

In [29]:
dd[0]

0    101
1    102
2    132
Name: 0, dtype: int64

In [30]:
dd[1]

0     john
1    anoop
2     nila
Name: 1, dtype: object

In [31]:
dd[2]

0    23
1    25
2    32
Name: 2, dtype: int64

In [32]:
dd=pd.DataFrame(list,columns=['id','name','age'])
dd

    id   name  age
0  101   john   23
1  102  anoop   25
2  132   nila   32

In [33]:
dd.loc[2,['name']]

name    nila
Name: 2, dtype: object

In [34]:
dd.loc[1,['age']]

age    25
Name: 1, dtype: object

In [36]:
dd.iloc[[2,1]]

    id   name  age
2  132   nila   32
1  102  anoop   25

In [37]:
dd.iloc[[0,1]]

    id   name  age
0  101   john   23
1  102  anoop   25